# Challenge Questions - Employees Dataset

#

## Import pandas, numpy and datetime

In [1]:
import pandas as pd
import numpy as np

In [2]:
import datetime as dt

## Load the files:
• "employees.csv" should be assigned to the variable **emp**

• "departments.csv" should be assigned to the variable **dept**

• "salaries.csv" should be assigned to the variable **sal**

In [3]:
emp=pd.read_csv('employees.csv')

In [4]:
dept=pd.read_csv('departments.csv')

In [5]:
sal=pd.read_csv('salaries.csv')

## Check the head of all three DataFrames

In [6]:
emp.head()

   emp_no dept_no   hire_date leaving_date
0   10001      D5  26/06/2006          NaN
1   10002      D6  21/11/2005          NaN
2   10003      D4  28/08/2006          NaN
3   10004      D4  01/12/2006          NaN
4   10005      D3  12/09/2009          NaN

In [39]:
dept.head()

  dept_no                dept_name  location
0      D1   Accounting and Finance   Chicago
1      D2          Human Resources  New York
2      D3  Supply Chain Operations   Chicago
3      D4                Marketing  New York
4      D5               Technology   Chicago

In [8]:
sal.head()

  emp_dept_key  salary
0     10001-D5   30546
1     10002-D6   36536
2     10003-D4   38323
3     10004-D4   31851
4     10005-D3   53435

## Check the data types of all three DataFrames

In [9]:
emp.dtypes

emp_no           int64
dept_no         object
hire_date       object
leaving_date    object
dtype: object

In [10]:
dept.dtypes

dept_no      object
dept_name    object
location     object
dtype: object

In [11]:
sal.dtypes

emp_dept_key    object
salary           int64
dtype: object

## Change the data types accordingly. 

• emp_no, dept_no, dept_name, location, emp_depy_key should all be string data types

• hire_date and leaving_date should be datetime64

• salary should be int64

In [6]:
emp[['emp_no', 'dept_no']]=emp[['emp_no', 'dept_no']].astype('string')

In [10]:
emp['hire_date']=pd.to_datetime(emp['hire_date'] , format='%d%m%y')

In [12]:
emp['leaving_date']=pd.to_datetime(emp['leaving_date'] , format='%d%m%y')

In [13]:
emp.dtypes

emp_no                  string
dept_no                 string
hire_date       datetime64[ns]
leaving_date    datetime64[ns]
dtype: object

In [14]:
dept[['dept_no','dept_name','location']]= dept[['dept_no','dept_name','location']].astype('string')

In [59]:
dept.dtypes

dept_no      string
dept_name    string
location     string
dtype: object

In [15]:
sal['emp_dept_key']= sal['emp_dept_key'].astype('string')

In [62]:
sal.dtypes

emp_dept_key    string
salary           int64
dtype: object

## How many employees are currently working at the company. 

The employees still employed do not have a leaving date value. You can use the isnull() method to identify nulls or NaN values.

isnull(): https://pandas.pydata.org/docs/reference/api/pandas.isnull.html

In [20]:
pd.isnull(emp['leaving_date'])

0       True
1       True
2       True
3       True
4       True
       ...
995     True
996     True
997    False
998    False
999     True
Name: leaving_date, Length: 1000, dtype: bool

In [ ]:
or

In [67]:
emp['leaving_date'].isnull()

0       True
1       True
2       True
3       True
4       True
       ...
995     True
996     True
997    False
998    False
999     True
Name: leaving_date, Length: 1000, dtype: bool

In [65]:
pd.isnull(emp['leaving_date']).count()

1000

In [73]:
emp[emp['leaving_date'].isnull()==True].count()

emp_no          741
dept_no         741
hire_date       741
leaving_date      0
dtype: int64

## How many currently employed people are there per department.

In [74]:
currently_employed=emp[emp['leaving_date'].isnull()==True]

In [79]:
currently_employed.groupby(by='dept_no').count()['emp_no']

dept_no
D1     84
D2     36
D3     94
D4    171
D5    188
D6    168
Name: emp_no, dtype: int64

## Perform a left join on the emp and dept DataFrames (with emp as the left DF). Assign the result of this to the variable emp_dept

In [16]:
emp_dept=emp.join(dept.set_index('dept_no'), on='dept_no', how='left')

In [22]:
emp_dept.head()

  emp_no dept_no  hire_date leaving_date                dept_name  location
0  10001      D5 2006-06-26          NaT               Technology   Chicago
1  10002      D6 2005-11-21          NaT                    Sales   Chicago
2  10003      D4 2006-08-28          NaT                Marketing  New York
3  10004      D4 2006-01-12          NaT                Marketing  New York
4  10005      D3 2009-12-09          NaT  Supply Chain Operations   Chicago

## Perform a left join on the newly created "emp_dept" DataFrame and the "sal" DataFrame. 
## Assign this resulting DataFrame to the variable "emp_dept_sal"

• You will need to think about how to join the two tables. Note the emp_dept_key on the sal DataFrame is in the format 'emp_id-dept_id'

In [17]:
sal['emp_no']= sal['emp_dept_key'].apply(lambda x:x[:5])

In [20]:
emp_dept_sal=emp_dept.join(sal.set_index('emp_no'), on='emp_no', how='left')

In [21]:
emp_dept_sal.head()

,emp_no,dept_no,hire_date,leaving_date,dept_name,location,emp_dept_key,salary
0,10001,D5,2006-06-26,NaT,Technology,Chicago,10001-D5,30546
1,10002,D6,2005-11-21,NaT,Sales,Chicago,10002-D6,36536
2,10003,D4,2006-08-28,NaT,Marketing,New York,10003-D4,38323
3,10004,D4,2006-01-12,NaT,Marketing,New York,10004-D4,31851
4,10005,D3,2009-12-09,NaT,Supply Chain Operations,Chicago,10005-D3,53435

## Drop the column "emp_dept_key"

In [22]:
emp_dept_sal.drop(columns='emp_dept_key', inplace=True)

In [23]:
emp_dept_sal

,emp_no,dept_no,hire_date,leaving_date,dept_name,location,salary
0,10001,D5,2006-06-26,NaT,Technology,Chicago,30546
1,10002,D6,2005-11-21,NaT,Sales,Chicago,36536
2,10003,D4,2006-08-28,NaT,Marketing,New York,38323
3,10004,D4,2006-01-12,NaT,Marketing,New York,31851
4,10005,D3,2009-12-09,NaT,Supply Chain Operations,Chicago,53435
...,...,...,...,...,...,...,...
997,10905,D4,2005-02-28,2006-07-03,Marketing,New York,32735
998,10906,D2,2014-01-20,2021-04-25,Human Resources,New York,29095
998,10906,D2,2014-01-20,2021-04-25,Human Resources,New York,97330
999,10906,D6,2014-01-20,NaT,Sales,Chicago,29095
999,10906,D6,2014-01-20,NaT,Sales,Chicago,97330

## What is the average salary per department?

In [39]:
avg_sal=emp_dept_sal.groupby(by='dept_name').mean('sal')

In [40]:
avg_sal

                               salary
dept_name
Accounting and Finance   52148.887324
Human Resources          44849.602740
Marketing                41540.041985
Sales                    59192.053640
Supply Chain Operations  45183.788462
Technology               58975.979592

## What is the average salary by location?

In [41]:
avgsal_loca=emp_dept_sal.groupby(by='location').mean('sal')

In [42]:
avgsal_loca

                salary
location
Chicago   55383.208675
New York  42261.229851

## How many people were hired each year in each of the last 10 years?

In [26]:
pd.pivot_table(data=emp_dept_sal,index='hire_date',aggfunc='count',values='emp_no').tail(10)

            emp_no
hire_date
2018-06-09       1
2018-06-10       1
2018-07-10       1
2018-07-13       1
2018-08-18       1
2018-10-16       1
2019-03-23       1
2019-03-30       4
2019-04-30       1
2019-10-28       1